/*
int n = new Random().Next(10, 100);
int a = n / 10;
int b = n % 10;
Console.WriteLine(n);
if (a > b)
    Console.WriteLine(a);
else if (a < b)
    Console.WriteLine(b);
else
    Console.WriteLine("=");
*/
/*
11. Напишите программу, которая выводит случайное трёхзначное число и удаляет вторую цифру этого числа.
456 -> 46
782 -> 72
918 -> 98
*/
/*
int n = new Random().Next(100, 1000);
int a = n / 100;
int b = n % 10;
Console.WriteLine(n);

Console.WriteLine(a);
Console.WriteLine(b);

/*
int n = new Random().Next(100, 1000);
Console.WriteLine(n);
Console.WriteLine((n / 100) * 10 + n % 10);
*/



/*
12 Напишите программу, которая будет
принимать на вход два числа и выводить,
является ли второе число кратным первому.
Если число 2 не кратно числу 1, то программа
выводит остаток от деление.
34, 5 -> не кратно, остаток 4
16, 4 -> кратно
*/
/*
Console.WriteLine("Введите число а:");
int n =Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число b:");
int m = Convert.ToInt32(Console.ReadLine());
if (n%m==0)
    Console.WriteLine("yes");
else
    Console.WriteLine(n % m);
*/


/*
14 Напишите программу, которая принимает
на вход число и проверяет, кратно ли оно
одновременно 7 и 23
14 -> нет
46 -> нет
161 -> да
*/

/*
Console.WriteLine("Введите число n:");
int n = Convert.ToInt32(Console.ReadLine());
if ((n % 7 == 0) && (n % 23 == 0))
    Console.WriteLine("yes");
else
    Console.WriteLine("yes");
*/

/*
16 Напишите программу, которая
принимает на вход два числа и проверяет,
является ли одно число квадратом другого.
5, 25 -> да
-4, 16 -> да
25, 5 -> да
8,9 -> нет
*/

/*
Console.WriteLine("Введите число а:");
int n =Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число b:");
int m = Convert.ToInt32(Console.ReadLine());
if ((n*n==m) || (m*m==n))
    Console.WriteLine("yes");
else
    Console.WriteLine("no");

    */

/*
Console.WriteLine("Enter first number");
int x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Enter sekend number");
int y = Convert.ToInt32(Console.ReadLine());
if (x / y == y || y / x == x) Console.WriteLine("yes");
else Console.WriteLine("no");
*/
/*

Console.Clear(); // Очистка консоли
int[] arr = new int[5];
Console.WriteLine("[" + string.Join(", ", arr) + "]");
for (int i = 0; i < arr.Length; i++)
    arr[i] = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("[" + string.Join(", ", arr) + "]");


*/


